# Input and output
## CSV files

In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt

In [2]:
import os

os.getcwd()

'/Users/solteszattila/dev/data_science_course/Projects/ds_learn_notebooks'

In [3]:
df = pd.read_csv('DATA/example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df = pd.read_csv('DATA/example.csv', header=None)
df

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [5]:
df = pd.read_csv('DATA/example.csv', index_col=0)
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [6]:
df.to_csv('saved_data/example_new.csv', index=True)

In [7]:
new = pd.read_csv('saved_data/example_new.csv')
new

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## HTML tables

In [8]:
url = 'https://en.wikipedia.org/wiki/World_population'

In [9]:
tables = pd.read_html(url)

In [10]:
len(tables)

26

In [11]:
tables[0]

        World population (millions, UN estimates)[15]  \
                                                    #
0                                                   1
1                                                   2
2                                                   3
3                                                   4
4                                                   5
5                                                   6
6                                                   7
7                                                   8
8                                                   9
9                                                  10
10                                                NaN
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                      Top ten most populous countries
0                                            China[B]
1                                               India
2                                       United States
3                                           Indonesia
4                                            Pakistan
5                                              Brazil
6                                             Nigeria
7                                          Bangladesh
8                                              Russia
9                                              Mexico
10                                        World total
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2000
0                                                1270
1                                                1053
2                                                 283
3                                                 212
4                                                 136
5                                                 176
6                                                 123
7                                                 131
8                                                 146
9                                                 103
10                                               6127
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2015
0                                                1376
1                                                1311
2                                                 322
3                                                 258
4                                                 208
5                                                 206
6                                                 182
7                                                 161
8                                                 146
9                                                 127
10                                               7349
11  Notes: .mw-parser-output .reflist{font-size:90...


                                              2030[A]
0                                                1416
1                                                1528
2                                                 356
3                                                 295
4                                                 245
5                                                 228
6                                                 263
7                                                 186
8                                                 149
9                                                 148
10                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...

In [12]:
tables[1]

,Region,Density(inhabitants/km2),Population(millions),Most populous country,Most populous city (metropolitan area)
0,Asia,104.1,4641,"1,411,778,000[note 1] – China","37,400,000/13,515,000 – Greater Tokyo Area/Tok..."
1,Africa,44.4,1340,"0211,401,000 – Nigeria","20,076,000/9,500,000 – Greater Cairo/Cairo"
2,Europe,73.4,747,"0146,171,000 – Russia;approx. 110 million in E...","20,004,000/13,200,000 – Moscow metropolitan ar..."
3,Latin America,24.1,653,"0214,103,000 – Brazil","21,650,000/12,252,000 – São Paulo Metro Area/S..."
4,Northern America[note 2],14.9,368,"0332,909,000 – United States","18,819,000/8,804,000 – New York metropolitan a..."
5,Oceania,5,42,"0025,917,000 – Australia","5,367,000 – Sydney"
6,Antarctica,~0,0.004[17],N/A[note 3],"1,258 – McMurdo Station"

In [13]:
tables[1].columns

Index(['Region', 'Density(inhabitants/km2)', 'Population(millions)',
       'Most populous country', 'Most populous city (metropolitan area)'],
      dtype='object')

In [14]:
tables[0].columns

MultiIndex([('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...)],
           )

In [15]:
world_topten = tables[0]

In [16]:
world_topten = world_topten['World population (millions, UN estimates)[15]']
world_topten

,#,Top ten most populous countries,2000,2015,2030[A]
0,1,China[B],1270,1376,1416
1,2,India,1053,1311,1528
2,3,United States,283,322,356
3,4,Indonesia,212,258,295
4,5,Pakistan,136,208,245
5,6,Brazil,176,206,228
6,7,Nigeria,123,182,263
7,8,Bangladesh,131,161,186
8,9,Russia,146,146,149
9,10,Mexico,103,127,148
10,NaN,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

In [17]:
world_topten = world_topten.drop(11, axis=0)

In [18]:
world_topten

      # Top ten most populous countries  2000  2015 2030[A]
0     1                        China[B]  1270  1376    1416
1     2                           India  1053  1311    1528
2     3                   United States   283   322     356
3     4                       Indonesia   212   258     295
4     5                        Pakistan   136   208     245
5     6                          Brazil   176   206     228
6     7                         Nigeria   123   182     263
7     8                      Bangladesh   131   161     186
8     9                          Russia   146   146     149
9    10                          Mexico   103   127     148
10  NaN                     World total  6127  7349    8501

In [19]:
world_topten = world_topten.drop('#', axis=1)
world_topten

   Top ten most populous countries  2000  2015 2030[A]
0                         China[B]  1270  1376    1416
1                            India  1053  1311    1528
2                    United States   283   322     356
3                        Indonesia   212   258     295
4                         Pakistan   136   208     245
5                           Brazil   176   206     228
6                          Nigeria   123   182     263
7                       Bangladesh   131   161     186
8                           Russia   146   146     149
9                           Mexico   103   127     148
10                     World total  6127  7349    8501

In [20]:
world_topten.columns = ['Country', '2000', '2015', '2030 est.']

In [21]:
world_topten

          Country  2000  2015 2030 est.
0        China[B]  1270  1376      1416
1           India  1053  1311      1528
2   United States   283   322       356
3       Indonesia   212   258       295
4        Pakistan   136   208       245
5          Brazil   176   206       228
6         Nigeria   123   182       263
7      Bangladesh   131   161       186
8          Russia   146   146       149
9          Mexico   103   127       148
10    World total  6127  7349      8501

In [22]:
tables[6]

,Rank,Country,Population,Area(km2),Density(pop/km2),Population trend
0,1,India,1387110000,3287240,422,Growing
1,2,Pakistan,226410000,803940,282,Rapidly growing
2,3,Bangladesh,172090000,143998,1195,Rapidly growing
3,4,Japan,126010000,377873,333,Declining[99]
4,5,Philippines,111390000,300000,371,Growing
5,6,Vietnam,96209000,331689,290,Growing
6,7,United Kingdom,66436000,243610,273,Growing
7,8,South Korea,51781000,99538,520,Steady
8,9,Taiwan,23604000,36193,652,Steady
9,10,Sri Lanka,21803000,65610,332,Growing

In [23]:
tables[6].set_index('Rank')

             Country  Population  Area(km2)  Density(pop/km2) Population trend
Rank
1              India  1387110000    3287240               422          Growing
2           Pakistan   226410000     803940               282  Rapidly growing
3         Bangladesh   172090000     143998              1195  Rapidly growing
4              Japan   126010000     377873               333    Declining[99]
5        Philippines   111390000     300000               371          Growing
6            Vietnam    96209000     331689               290          Growing
7     United Kingdom    66436000     243610               273          Growing
8        South Korea    51781000      99538               520           Steady
9             Taiwan    23604000      36193               652           Steady
10         Sri Lanka    21803000      65610               332          Growing

In [24]:
world_topten.to_html('saved_data/sample_table.html', index=False)

## Excel files

In [25]:
df = pd.read_excel('DATA/my_excel_file.xlsx', sheet_name='First_Sheet')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [26]:
wb = pd.ExcelFile('DATA/my_excel_file.xlsx')
wb.sheet_names

['First_Sheet']

In [27]:
excel_sheet_dict = pd.read_excel('DATA/my_excel_file.xlsx', sheet_name=None)
excel_sheet_dict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [28]:
type(excel_sheet_dict)

dict

In [29]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [30]:
excel_sheet_dict['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [31]:
our_df = excel_sheet_dict['First_Sheet']

In [32]:
our_df.to_excel('saved_data/example.xlsx', sheet_name='First_Sheet', index=False)

## SQL databases

In [34]:
from sqlalchemy import create_engine

In [35]:
temp_db = create_engine('sqlite:///:memory:')

In [36]:
df = pd.DataFrame(data=np.random.randint(0, 100, size=(4, 4)), columns=['a', 'b', 'c', 'd'])
df

    a   b   c   d
0  38   7   5  41
1  39  53  47  78
2  43  34  95   8
3  33  74  41  31

In [37]:
df.to_sql(name='new_table', con=temp_db)

In [39]:
new_df = pd.read_sql(sql='new_table', con=temp_db, index_col='index')
new_df

        a   b   c   d
index
0      38   7   5  41
1      39  53  47  78
2      43  34  95   8
3      33  74  41  31

In [40]:
pd.read_sql_query(sql="SELECT a,c FROM new_table", con=temp_db)

    a   c
0  38   5
1  39  47
2  43  95
3  33  41